{
  "education": [
    {
      "id": 1,
      "title": "AP in Computer Science",
      "institution": "University College Northern Jutland",
      "from": "2023-09",
      "to": null,
      "color": "#3b82f6",
      "description": "Learning the ins and outs of computers",
      "highlights": [
        "Currently pursuing AP degree in Computer Science",
        "Focus on practical programming and system development",
        "Building foundation in software engineering principles"
      ],
      "projects": [
        {
          "name": "3rd Semester Project",
          "url": "https://github.com/MikkelVibe/BeerWebshop"
        },
        {
          "name": "4th Semester Project",
          "url": "https://github.com/MikkelVibe/ETLFrontend"
        }
      ]
    },
    {
      "id": 2,
      "title": "HTX - Upper Secondary Education",
      "institution": "Tradium",
      "from": "2019-08",
      "to": "2022-06",
      "color": "#10b981",
      "description": "Specialized with Game Development and Informatics",
      "highlights": [
        "Specialized with Game Development and Informatics",
        "Developed technical foundation in programming",
        "Completed upper secondary education with technical focus"
      ],
      "projects": [
        {
          "name": "Game Dev Project",
          "url": "https://winnermikkel3.itch.io/terminator-game"
        }
      ]
    }
  ],
  "work": [
    {
      "id": 1,
      "company": "Econta Consulting Group",
      "color": "#6366f1",
      "roles": [
        {
          "position": "Junior Full-stack Developer",
          "from": "2025-07",
          "to": null,
          "description": "Promoted to a full-stack role with responsibilities across both frontend and backend systems, focusing on feature development and performance improvements.",
          "highlights": [
            "Refactored an underperforming RPA dashboard to significantly improve performance and stability",
            "Started implementing backend features and optimizing API performance",
            "Collaborated with team members to deliver full-stack enhancements to the internal tool"
          ],
          "projects": []
        },
        {
          "position": "Junior Frontend Developer",
          "from": "2025-06",
          "to": "2025-07",
          "description": "Focused on improving internal frontend tools using Vue.js",
          "highlights": [
            "Improved code structure, readability, and maintainability in a Vue.js codebase",
            "Redesigned the user interface based on personal initiative, which was later approved and adopted by stakeholders",
            "Improved user experience by fixing layout issues and enhancing component logic"
          ],
          "projects": []
        }
      ]
    },
    {
      "id": 2,
      "company": "WEXO A/S",
      "color": "#004684",
      "roles": [
        {
          "position": "Intern Full-stack Developer",
          "from": "2025-08",
          "to": null,
          "description": "Worked across both frontend and backend systems, focusing on feature development, plugin customization in Shopware, AI integration for client solutions, and performance improvements. Gained experience in professional project workflows, agile development, and collaborating with cross-functional teams.",
          "highlights": [
            "Developed and customized Shopware plugins using PHP, TypeScript, and Twig",
            "Integrated AI solutions to automate product feature generation and image rendering for clients",
            "Planned, estimated, and executed tasks independently while receiving feedback through code reviews",
            "Learned and applied WEXO’s agile and iterative development processes",
            "Collaborated effectively with colleagues and participated in team meetings, demos, and client-focused presentations",
            "Contributed to performance improvements in plugins, including delayed cookie popups and API optimization"
          ],
          "projects": []
        }
      ]
    }
  ]
}